Data Analysis using Pandas to help from "geeks for geeks".

Analyze data in pandas with: 
  1. Series
  2. Data Frames
Series is (1-D) array defined in pandas to store any data type.

In [27]:
#Import panda Library
import pandas as pd

## Data contains Scalar Values @@@SERIES
#program to create series with scalar values
data = [1, 4, 5, 7, 2, 9] 
#Create series with defult index values
s = pd.Series(data)
print(s)

0    1
1    4
2    5
3    7
4    2
5    9
dtype: int64

In [28]:
#decleare the index values
index = ['a', 'b', 'c', 'd', 'e', 'f']
si = pd.Series(data, index)
print(si)

a    1
b    4
c    5
d    7
e    2
f    9
dtype: int64

In [30]:
##Data contains Dictionary
dictionary = {'a':1, 'b':4, 'c':5, 'd':7, 'e':2, 'f':9}
sd= pd.Series(dictionary)
sd #print

a    1
b    4
c    5
d    7
e    2
f    9
dtype: int64

In [32]:
##Data contains Ndarry
data = [[2,3,4], [5,6,7]] #2-D array
s2d = pd.Series(data)
s2d

0    [2, 3, 4]
1    [5, 6, 7]
dtype: object

In [35]:
# @@DataFrame
a = pd.DataFrame(data) #create DataFrame with data
a

   0  1  2
0  2  3  4
1  5  6  7

In [39]:
#program to create data frame with two dictionary
dict1 = {'a':1, 'b':2, 'c':4}
dict2 = {'a':5, 'b':6, 'c':7, 'd':8}
data = {"first": dict1, "second": dict2}
df = pd.DataFrame(data)
df

   first  second
a    1.0       5
b    2.0       6
c    4.0       7
d    NaN       8

In [45]:
# @@Data: Series & Dictionary
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])
s2 = pd.Series([1.1, 3.5, 4.7, 5.8, 2.9, 9.3])
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'])

data = {'first':s1, 'second':s2, 'third':s3}
dfseries = pd.DataFrame(data)
dfseries

   first  second third
0      1     1.1     a
1      3     3.5     b
2      4     4.7     c
3      5     5.8     d
4      6     2.9     e
5      2     9.3   NaN
6      9     NaN   NaN

In [47]:
# Data is 2D-numpy ndarray
import pandas as pd
d1 = [[2,3,4], [5,6,7]]  # define 2d array 1
d2 = [[2,4,8], [1,3,9]]  # define 2d array 2 
data = {'first': d1, 'second': d2}
df2d = pd.DataFrame(data)
df2d

       first     second
0  [2, 3, 4]  [2, 4, 8]
1  [5, 6, 7]  [1, 3, 9]